#+TITLE: LogSense Readme - Monitor your Rails app easy and fast
#+AUTHOR: Adolfo Villafiorita
#+STARTUP: showall

* Usage

  #+begin_src bash :results raw output :wrap example :exports both
  log_sense --help
  #+end_src

  #+RESULTS:
  #+begin_example
  Usage: log_sense [options] [logfile ...]
          --title=TITLE                Title to use in the report
      -f, --input-format=FORMAT        Log format (stored in log or sqlite3): rails or apache (DEFAULT: apache)
      -i, --input-files=file,file,     Input file(s), log file or sqlite3 (can also be passed as arguments)
      -t, --output-format=FORMAT       Output format: html, txt, sqlite, ufw (DEFAULT: html)
      -o, --output-file=OUTPUT_FILE    Output file. (DEFAULT: STDOUT)
      -b, --begin=DATE                 Consider only entries after or on DATE
      -e, --end=DATE                   Consider only entries before or on DATE
      -l, --limit=N                    Limit to the N most requested resources (DEFAULT: 100)
      -w, --width=WIDTH                Maximum width of long columns in textual reports
      -r, --rows=ROWS                  Maximum number of rows for columns with multiple entries in textual reports
      -p, --pattern=PATTERN            Pattern to use with ufw report to select IP to blacklist (DEFAULT: php)
      -c, --crawlers=POLICY            Decide what to do with crawlers (applies to Apache Logs)
          --no-selfpoll                Ignore self poll entries (requests from ::1; applies to Apache Logs) (DEFAULT: false)
          --no-geo                     Do not geolocate entries (DEFAULT: true)
          --verbose                    Inform about progress (output to STDERR) (DEFAULT: false)
      -v, --version                    Prints version information
      -h, --help                       Prints this help

  This is version 2.0.0

  Output formats:

  - rails: txt, html, sqlite3, ufw
  - apache: txt, html, sqlite3, ufw
  #+end_example

Examples:

#+begin_example sh
log_sense -f apache -i access.log -t txt > access-data.txt
log_sense -f rails -i production.log -t html -o performance.html
#+end_example

